<template>
  <div>
    <v-img
      class="pageImgHead"
      lazy-src="/assets/images/sheets/Analytic/head.png"
      :src="require('/assets/images/sheets/Analytic/head.png')"
      width="96%"
      alt=""
    />
    <template v-for="block in datablock">
      <div v-if="block.condition == $route.params.course" :key="block.condition" class="coursePage">
        <p class="title">
          {{ block.title }}
        </p>
        <div class="coursePage_inner">
          <div class="innerTitle">
            <div class="col">
              <p class="title">
                {{ block.info.name }}
              </p>
              <p class="text">
                {{ block.info.description }}
              </p>
            </div>
            <div class="col">
              <nuxt-link :to="block.info.linkNext" class="linkNext btn_blue">
                <p>
                  {{ block.info.linkNextText }}
                </p>
                <div>
                  <svg viewBox="0 0 13 16">
                    <path d="M12 6.26795C13.3333 7.03775 13.3333 8.96225 12 9.73205L3 14.9282C1.66667 15.698 -7.31543e-07 14.7358 -6.64245e-07 13.1962L-2.09983e-07 2.80385C-1.42685e-07 1.26425 1.66667 0.301995 3 1.0718L12 6.26795Z" fill="#232832" />
                  </svg>
                </div>
              </nuxt-link>
            </div>
          </div>
          <div class="info_inner">
            <div class="col">
              <div v-for="category in block.info.categories" :key="category.title" class="category">
                <div class="category_title">
                  {{ category.title }}
                  <svg viewBox="0 0 10 16">
                    <path d="M10 8L-4.17252e-07 0.5L2.38419e-07 15.5L10 8Z" fill="white" />
                  </svg>
                </div>
                <div
                  v-for="categoryBlck in category.categoryBlock"
                  :key="categoryBlck.nameBlock"
                  class="categoty_block"
                  :class="{ btn_blue: categoryBlck.isActive }"
                  @click="resetCategory(); categoryBlck.isActive = true"
                >
                  <svg v-if="categoryBlck.type == 'video'" viewBox="0 0 50 42" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M47.4468 30.14H2.55347C1.14551 30.14 0 28.995 0 27.5873V3.44788C0 2.04022 1.14551 0.89502 2.55347 0.89502H47.4468C48.8543 0.89502 50 2.04022 50 3.44788V27.5873C50 28.995 48.8543 30.14 47.4468 30.14ZM2.55347 2.95716C2.28265 2.95716 2.06194 3.17726 2.06194 3.44788V27.5873C2.06194 27.8579 2.28265 28.0781 2.55347 28.0781H47.4468C47.7176 28.0781 47.938 27.8579 47.938 27.5873V3.44788C47.938 3.17726 47.7177 2.95716 47.4468 2.95716H2.55347Z" fill="white" />
                    <path d="M19.6623 23.3532C19.3237 23.168 19.1035 22.8228 19.1035 22.4371V8.59844C19.1035 8.21252 19.3192 7.85915 19.6623 7.68211C20.0051 7.50517 20.4178 7.53466 20.7323 7.75834L30.4627 14.6776C30.735 14.8711 30.8962 15.1842 30.8962 15.5178C30.8962 15.8516 30.735 16.1647 30.4627 16.3581C30.4627 16.3581 23.1645 21.5473 20.7323 23.2772C20.5545 23.4036 20.1714 23.6319 19.6623 23.3532ZM21.1659 10.5968V20.4387L28.086 15.5178L21.1659 10.5968Z" fill="white" />
                    <path d="M48.9691 35.9928H29.2619C28.8043 34.2397 27.2071 32.9424 25.3128 32.9424C23.4186 32.9424 21.8218 34.2397 21.3641 35.9928H1.03102C0.461735 35.9928 0 36.4545 0 37.0238C0 37.5933 0.461735 38.0548 1.03102 38.0548H21.3642C21.8219 39.8079 23.4188 41.1054 25.3129 41.1054C27.2072 41.1054 28.8044 39.8078 29.262 38.0548H48.9691C49.538 38.0548 50 37.5934 50 37.0238C50 36.4545 49.538 35.9928 48.9691 35.9928ZM25.3128 39.0432C24.1997 39.0432 23.2936 38.1373 23.2936 37.0237C23.2936 35.9103 24.1997 35.0045 25.3128 35.0045C26.4263 35.0045 27.3322 35.9103 27.3322 37.0237C27.3322 38.1374 26.4263 39.0432 25.3128 39.0432Z" fill="white" />
                  </svg>
                  <svg v-if="categoryBlck.type == 'info'" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_234_576)">
                      <path d="M9.16727 22.4996C7.32896 22.4996 5.83398 21.0046 5.83398 19.1663C5.83398 17.328 7.32896 15.833 9.16727 15.833C11.0056 15.833 12.5005 17.328 12.5005 19.1663C12.5005 21.0046 11.0056 22.4996 9.16727 22.4996ZM9.16727 17.4996C8.24792 17.4996 7.50063 18.2473 7.50063 19.1663C7.50063 20.0856 8.24792 20.8329 9.16727 20.8329C10.0862 20.8329 10.8339 20.0856 10.8339 19.1663C10.8339 18.2473 10.0862 17.4996 9.16727 17.4996Z" fill="white" />
                      <path d="M40.8333 33.3336C38.995 33.3336 37.5 31.8386 37.5 30.0003C37.5 28.162 38.995 26.667 40.8333 26.667C42.6716 26.667 44.1666 28.162 44.1666 30.0003C44.1666 31.8386 42.6716 33.3336 40.8333 33.3336ZM40.8333 28.3336C39.9143 28.3336 39.1666 29.0813 39.1666 30.0003C39.1666 30.9196 39.9143 31.6669 40.8333 31.6669C41.7526 31.6669 42.4999 30.9196 42.4999 30.0003C42.4999 29.0813 41.7526 28.3336 40.8333 28.3336Z" fill="white" />
                      <path d="M9.16727 44.1666C7.32896 44.1666 5.83398 42.6716 5.83398 40.8333C5.83398 38.995 7.32896 37.5 9.16727 37.5C11.0056 37.5 12.5005 38.995 12.5005 40.8333C12.5005 42.6716 11.0056 44.1666 9.16727 44.1666ZM9.16727 39.1666C8.24792 39.1666 7.50063 39.9143 7.50063 40.8333C7.50063 41.7526 8.24792 42.4999 9.16727 42.4999C10.0862 42.4999 10.8339 41.7526 10.8339 40.8333C10.8339 39.9143 10.0862 39.1666 9.16727 39.1666Z" fill="white" />
                      <path d="M39.1665 18.3336H15.8331C15.3731 18.3336 15 17.9602 15 17.5001C15 17.0401 15.3731 16.667 15.8331 16.667H39.1665C39.6265 16.667 40 17.0401 40 17.5001C40 17.9602 39.6265 18.3336 39.1665 18.3336Z" fill="white" />
                      <path d="M43.3333 21.6666H15.8331C15.3731 21.6666 15 21.2932 15 20.8331C15 20.3731 15.3731 20 15.8331 20H43.3333C43.7933 20 44.1664 20.3731 44.1664 20.8331C44.1664 21.2932 43.7933 21.6666 43.3333 21.6666Z" fill="white" />
                      <path d="M30.0005 29.1666H6.66711C6.20706 29.1666 5.83398 28.7932 5.83398 28.3331C5.83398 27.8731 6.20706 27.5 6.66711 27.5H30.0005C30.4605 27.5 30.834 27.8731 30.834 28.3331C30.834 28.7932 30.4605 29.1666 30.0005 29.1666Z" fill="white" />
                      <path d="M34.1673 32.4996H6.66711C6.20706 32.4996 5.83398 32.1262 5.83398 31.6661C5.83398 31.2061 6.20706 30.833 6.66711 30.833H34.1673C34.6273 30.833 35.0004 31.2061 35.0004 31.6661C35.0004 32.1262 34.6273 32.4996 34.1673 32.4996Z" fill="white" />
                      <path d="M39.1665 40.0006H15.8331C15.3731 40.0006 15 39.6272 15 39.1671C15 38.7071 15.3731 38.334 15.8331 38.334H39.1665C39.6265 38.334 40 38.7071 40 39.1671C40 39.6272 39.6265 40.0006 39.1665 40.0006Z" fill="white" />
                      <path d="M43.3333 43.3336H15.8331C15.3731 43.3336 15 42.9602 15 42.5001C15 42.0401 15.3731 41.667 15.8331 41.667H43.3333C43.7933 41.667 44.1664 42.0401 44.1664 42.5001C44.1664 42.9602 43.7933 43.3336 43.3333 43.3336Z" fill="white" />
                      <path d="M46.2502 50H3.74985C1.68266 50 0 48.3173 0 46.2502V3.74985C0 1.68266 1.68266 0 3.74985 0H46.2502C48.3173 0 50 1.68266 50 3.74985V46.2502C50 48.3173 48.3173 50 46.2502 50ZM3.74985 1.66664C2.60162 1.66664 1.66664 2.60162 1.66664 3.74985V46.2502C1.66664 47.3984 2.60162 48.3334 3.74985 48.3334H46.2502C47.3991 48.3334 48.3334 47.3984 48.3334 46.2502V3.74985C48.3334 2.60162 47.3984 1.66664 46.2502 1.66664H3.74985Z" fill="white" />
                      <path d="M7.50078 8.33293H4.1675C3.70744 8.33293 3.33398 7.95985 3.33398 7.4998V4.16652C3.33398 3.70647 3.70744 3.33301 4.1675 3.33301H7.50078C7.96083 3.33301 8.33391 3.70647 8.33391 4.16652V7.4998C8.33391 7.95985 7.96083 8.33293 7.50078 8.33293ZM5.00063 6.66629H6.66727V4.99965H5.00063V6.66629Z" fill="white" />
                      <path d="M14.1668 8.33293H10.8335C10.3735 8.33293 10 7.95985 10 7.4998V4.16652C10 3.70647 10.3735 3.33301 10.8335 3.33301H14.1668C14.6268 3.33301 15.0003 3.70647 15.0003 4.16652V7.4998C15.0003 7.95985 14.6268 8.33293 14.1668 8.33293ZM11.6666 6.66629H13.3337V4.99965H11.6666V6.66629Z" fill="white" />
                      <path d="M20.8324 8.33293H17.4991C17.0391 8.33293 16.666 7.95985 16.666 7.4998V4.16652C16.666 3.70647 17.0391 3.33301 17.4991 3.33301H20.8324C21.2925 3.33301 21.6659 3.70647 21.6659 4.16652V7.4998C21.6659 7.95985 21.2925 8.33293 20.8324 8.33293ZM18.3327 6.66629H19.9993V4.99965H18.3327V6.66629Z" fill="white" />
                      <path d="M49.1665 11.6665H0.833511C0.373459 11.6665 0 11.2934 0 10.8334V3.74985C0 1.68266 1.68266 0 3.74985 0H46.2502C48.3173 0 50 1.68266 50 3.74985V10.8334C50 11.2934 49.6265 11.6665 49.1665 11.6665ZM1.66664 9.99985H48.3334V3.74985C48.3334 2.60162 47.3984 1.66664 46.2502 1.66664H3.74985C2.60162 1.66664 1.66664 2.60162 1.66664 3.74985V9.99985Z" fill="white" />
                    </g>
                    <defs>
                      <clipPath id="clip0_234_576">
                        <rect width="50" height="50" fill="white" />
                      </clipPath>
                    </defs>
                  </svg>
                  <svg v-if="categoryBlck.type == 'test'" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M19.0439 25.8621C18.6395 25.8621 18.3115 26.19 18.3115 26.5945V28.3917H13.1357V23.2159H15.5762C15.9807 23.2159 16.3086 22.888 16.3086 22.4835C16.3086 22.079 15.9807 21.7511 15.5762 21.7511H13.0869C12.3062 21.7511 11.6709 22.3863 11.6709 23.1671V28.4405C11.6709 29.2213 12.3062 29.8565 13.0869 29.8565H18.3604C19.1411 29.8565 19.7764 29.2213 19.7764 28.4405V26.5945C19.7764 26.19 19.4484 25.8621 19.0439 25.8621ZM16.0654 3.66211C16.0654 3.25762 15.7375 2.92969 15.333 2.92969C14.9285 2.92969 14.6006 3.25762 14.6006 3.66211C14.6006 4.0666 14.9285 4.39453 15.333 4.39453C15.7375 4.39453 16.0654 4.0666 16.0654 3.66211ZM12.4033 2.92969C11.9988 2.92969 11.6709 3.25762 11.6709 3.66211C11.6709 4.0666 11.9988 4.39453 12.4033 4.39453C12.8078 4.39453 13.1357 4.0666 13.1357 3.66211C13.1357 3.25762 12.8078 2.92969 12.4033 2.92969ZM15.2404 24.4169C14.9544 24.1309 14.4906 24.1309 14.2047 24.4169C13.9187 24.7029 13.9187 25.1667 14.2047 25.4526L15.277 26.5249C15.4769 26.7247 15.7394 26.8246 16.002 26.8246C16.2646 26.8246 16.5271 26.7246 16.727 26.5248L19.3912 23.8605C19.6772 23.5745 19.6772 23.1107 19.3912 22.8248C19.1052 22.5388 18.6414 22.5388 18.3555 22.8248L16.002 25.1783L15.2404 24.4169ZM49.2676 27.1523C49.6722 27.1523 50 26.8244 50 26.4199V7.86523C50 5.8459 48.3572 4.20312 46.3379 4.20312H41.2588V1.9043C41.2588 0.854297 40.4045 0 39.3545 0H10.6455C9.59551 0 8.74121 0.854297 8.74121 1.9043V4.20312H3.66211C1.64277 4.20312 0 5.8459 0 7.86523V35.4453C0 37.4646 1.64277 39.1074 3.66211 39.1074H20.7894L20.2315 43.2534H19.4154C18.7378 43.2534 18.138 43.7095 17.9568 44.3625L16.9253 48.0817C16.7978 48.5414 16.8903 49.0229 17.179 49.4024C17.4678 49.7821 17.9069 49.9999 18.3839 49.9999H31.616C32.0931 49.9999 32.5323 49.7821 32.821 49.4024C33.1097 49.0228 33.2021 48.5413 33.0747 48.0817L32.0432 44.3626C31.8621 43.7095 31.2624 43.2533 30.5845 43.2533H29.7684L29.2105 39.1073H46.3379C48.3572 39.1073 50 37.4646 50 35.4452V29.8378C50 29.4333 49.6722 29.1054 49.2676 29.1054C48.863 29.1054 48.5352 29.4333 48.5352 29.8378V35.4452C48.5352 36.6568 47.5494 37.6425 46.3379 37.6425H3.66211C2.45049 37.6425 1.46484 36.6568 1.46484 35.4452V7.86523C1.46484 6.65361 2.45049 5.66797 3.66211 5.66797H8.74121V7.13281H4.05273C3.4335 7.13281 2.92969 7.63662 2.92969 8.25586V33.5898C2.92969 34.2091 3.4335 34.7129 4.05273 34.7129H45.9473C46.5665 34.7129 47.0703 34.2091 47.0703 33.5898V8.25586C47.0703 7.63662 46.5665 7.13281 45.9473 7.13281H41.2588V5.66797H46.3379C47.5494 5.66797 48.5352 6.65361 48.5352 7.86523V26.4199C48.5352 26.8244 48.863 27.1523 49.2676 27.1523ZM30.5846 44.7183C30.6064 44.7183 30.6258 44.7329 30.6315 44.7539V44.754L31.6631 48.4733C31.6724 48.497 31.6414 48.5379 31.616 48.5352H18.3839C18.3587 48.5379 18.3273 48.4972 18.3368 48.4732L19.3684 44.754C19.3742 44.7329 19.3936 44.7182 19.4154 44.7182H30.5846V44.7183ZM22.2675 39.1074H27.7326L28.2904 43.2534H21.7096L22.2675 39.1074ZM8.74121 33.248H4.39453V8.59766H8.74121V33.248ZM39.7939 5.85938H18.3562C17.9517 5.85938 17.6237 6.1873 17.6237 6.5918C17.6237 6.99629 17.9517 7.32422 18.3562 7.32422H39.7939V33.248H10.2061V7.32422H14.9382C15.3427 7.32422 15.6706 6.99629 15.6706 6.5918C15.6706 6.1873 15.3427 5.85938 14.9382 5.85938H10.2061V1.9043C10.2061 1.66201 10.4032 1.46484 10.6455 1.46484H39.3545C39.5968 1.46484 39.7939 1.66201 39.7939 1.9043V5.85938ZM45.6055 8.59766V33.248H41.2588V8.59766H45.6055ZM15.2404 13.3817C14.9544 13.0957 14.4906 13.0957 14.2047 13.3817C13.9187 13.6678 13.9187 14.1315 14.2047 14.4175L15.277 15.4897C15.4769 15.6896 15.7394 15.7895 16.002 15.7895C16.2646 15.7895 16.5271 15.6895 16.727 15.4896L19.3912 12.8254C19.6772 12.5394 19.6772 12.0756 19.3912 11.7896C19.1052 11.5036 18.6414 11.5036 18.3555 11.7896L16.002 14.1432L15.2404 13.3817ZM18.2627 2.92969C17.8582 2.92969 17.5303 3.25762 17.5303 3.66211C17.5303 4.0666 17.8582 4.39453 18.2627 4.39453C18.6672 4.39453 18.9951 4.0666 18.9951 3.66211C18.9951 3.25762 18.6672 2.92969 18.2627 2.92969ZM19.0439 14.827C18.6395 14.827 18.3115 15.1549 18.3115 15.5594V17.3565H13.1357V12.1808H15.5762C15.9807 12.1808 16.3086 11.8528 16.3086 11.4483C16.3086 11.0438 15.9807 10.7159 15.5762 10.7159H13.0869C12.3062 10.7159 11.6709 11.3512 11.6709 12.1319V17.4054C11.6709 18.1861 12.3062 18.8214 13.0869 18.8214H18.3604C19.1411 18.8214 19.7764 18.1861 19.7764 17.4054V15.5594C19.7764 15.1549 19.4484 14.827 19.0439 14.827ZM21.9736 23.2159H37.5967C38.0013 23.2159 38.3291 22.888 38.3291 22.4835C38.3291 22.079 38.0013 21.7511 37.5967 21.7511H21.9736C21.5691 21.7511 21.2412 22.079 21.2412 22.4835C21.2412 22.888 21.5691 23.2159 21.9736 23.2159ZM21.9736 15.1104H37.5967C38.0013 15.1104 38.3291 14.7825 38.3291 14.378C38.3291 13.9735 38.0013 13.6456 37.5967 13.6456H21.9736C21.5691 13.6456 21.2412 13.9735 21.2412 14.378C21.2412 14.7825 21.5691 15.1104 21.9736 15.1104ZM21.9736 12.1808H37.5967C38.0013 12.1808 38.3291 11.8528 38.3291 11.4483C38.3291 11.0438 38.0013 10.7159 37.5967 10.7159H21.9736C21.5691 10.7159 21.2412 11.0438 21.2412 11.4483C21.2412 11.8528 21.5691 12.1808 21.9736 12.1808ZM21.9736 26.1456H37.5967C38.0013 26.1456 38.3291 25.8177 38.3291 25.4132C38.3291 25.0087 38.0013 24.6808 37.5967 24.6808H21.9736C21.5691 24.6808 21.2412 25.0087 21.2412 25.4132C21.2412 25.8177 21.5691 26.1456 21.9736 26.1456Z" fill="white" />
                  </svg>

                  {{ categoryBlck.nameBlock }}
                </div>
              </div>
              <div class="col">
                <template v-for="category in block.info.categories">
                  <div v-if="category.isActive" :key="category.title" class="categoty_content" />
                </template>
              </div>
            </div>
          </div>
        </div>
      </div>
    </template>
  </div>
</template>

<script>
// import Template from '../template.vue'
// import Template from '~/pages/template.vue'
export default {
  buildModules: ['nuxt-animejs'],
  name: 'CoursePage',
  filters: {},
  components: {
    // Template
    // Template
    // joinblock: () => import('~/components/joinBlock')
  },
  data () {
    return {

      datablock:
      [
        {
          condition: 'beginner',
          title: 'Курс «Начинающим»',
          info:
          {
            iframeLink: '',
            id: 0,
            name: 'Мир торговли',
            description: 'Курс новичка',
            linkNextText: 'Следующий урок Тест «Мир торговли»',
            linkNext: 'advanced',
            categories:
            [
              {
                title: 'Введение',
                isActive: false,
                categoryBlock:
                [
                  {
                    nameBlock: 'Мир торговли',
                    isActive: false,
                    videpPath: '',
                    svg: '',
                    type: 'video',
                    content: {}
                  },
                  {
                    nameBlock: 'Тест «Мир торговли»',
                    isActive: false,
                    videpPath: '',
                    svg: '',
                    type: 'test',
                    content: {}
                  },
                  {
                    nameBlock: 'Что такое Форекс',
                    isActive: false,
                    videpPath: '',
                    svg: '',
                    type: 'video',
                    content: {}
                  },
                  {
                    nameBlock: 'Тест «Что такое Форекс»',
                    isActive: false,
                    videpPath: '',
                    svg: '',
                    type: 'test',
                    content: {}
                  },
                  {
                    nameBlock: 'Брокер на рынке Форекс',
                    isActive: false,
                    videpPath: '',
                    svg: '',
                    type: 'info',
                    content: {}
                  },
                  {
                    nameBlock: 'Тест «Брокер на рынке Форекс»',
                    isActive: false,
                    videpPath: '',
                    svg: '',
                    type: 'test',
                    content: {}
                  },
                  {

                    nameBlock: 'Что такое акции и фонды',
                    isActive: false,
                    videpPath: '',
                    svg: '',
                    type: 'video',
                    content: {}
                  },
                  {

                    nameBlock: 'Тест «Что такое акции и фонды»',
                    isActive: false,
                    videpPath: '',
                    svg: '',
                    type: 'test',
                    content: {}
                  },
                  {

                    nameBlock: 'Как покупать и продавать акции',
                    isActive: false,
                    videpPath: '',
                    svg: '',
                    type: 'info',
                    content: {}
                  },
                  {

                    nameBlock: 'Тест «Как покупать и продавать акции»',
                    isActive: false,
                    videpPath: '',
                    svg: '',
                    type: 'test',
                    content: {}
                  },
                  {

                    nameBlock: 'Рыночная капитализация: стоимость компании',
                    isActive: false,
                    videpPath: '',
                    svg: '',
                    type: 'info',
                    content: {}
                  },
                  {

                    nameBlock: 'Тест «Рыночная капитализация: стоимость компании»',
                    isActive: false,
                    videpPath: '',
                    svg: '',
                    type: 'test',
                    content: {}
                  },
                  {

                    nameBlock: 'Что такое товары',
                    isActive: false,
                    videpPath: '',
                    svg: '',
                    type: 'video',
                    content: {}
                  },
                  {

                    nameBlock: 'Тест «Что такое товары»',
                    isActive: false,
                    videpPath: '',
                    svg: '',
                    type: 'test',
                    content: {}
                  },
                  {

                    nameBlock: 'Что такое индекс фондового рынка?',
                    isActive: false,
                    videpPath: '',
                    svg: '',
                    type: 'video',
                    content: {}
                  },
                  {
                    nameBlock: 'Тест «Что такое индекс фондового рынка»',
                    isActive: false,
                    videpPath: '',
                    svg: '',
                    type: 'test',
                    content: {}
                  }
                ]
              }
            ]
          }
        }
        // {
        //   condition: 'advanced',
        //   title: 'Курс «Начинающим»',
        //   info:
        //   {
        //     iframeLink: '',
        //     id: 1,
        //     name: 'Мир торговли',
        //     description: 'Курс новичка',
        //     linkNextText: 'Следующий урок Тест «Мир торговли»',
        //     linkNext: 'advanced'
        //   }
        // }
      ]
    }
  },
  computed: {},
  watch: {},
  created () {},
  mounted () {
  },
  beforeDestroy () {
  },
  methods: {
    resetCategory () {
      this.datablock.forEach((elementBlock) => {
        console.log('1')
        elementBlock.info.categories.forEach((category) => {
          console.log('2')
          category.categoryBlock.forEach((element) => {
            console.log('3')
            element.isActive = false
          })
        })
      })
    }
  }
}
</script>

<style lang="scss" scoped>
.coursePage{
  margin: 70/1920*100vw 130/1920*100vw ;
  .title{
    font-family: 'Manrope', sans-serif !important;
    font-style: normal !important;
    font-weight: 800 !important;
    font-size: $h2FS !important;
    line-height: 100%;
    /* or 48px */

    letter-spacing: 0.05em !important;
    text-transform: capitalize;
    text-align: center;
    margin-bottom: 80/1920*100vw;
  }
  .coursePage_inner{
    .innerTitle{
      @include makeitflex(row, space-between);
      margin-bottom: 30/1920*100vw;
      .col{
        align-self: end;
        .title{
          font-family: 'Manrope', sans-serif !important;
          font-style: normal !important;
          font-weight: 600 !important;
          font-size: $h1FS !important;
          line-height: 75/64*1;
          margin-bottom: 30/1920*100vw;
          text-align: left;
        }
        .text{
          font-family: 'Manrope', sans-serif !important;
          font-style: normal !important;
          font-weight: 600 !important;
          font-size: $h5FS !important;
          line-height: 28/1920*1 !important;
        }
        .linkNext{
          @include makeitflex(row,flex-start);
          width: fit-content;
          margin-left:auto ;
          margin-top:auto ;
          overflow: hidden;
          cursor: pointer;
          // perspective: 1px;
          // border-collapse: separate;
          >p{
            // background: linear-gradient(180deg, #1CB0FF 0%, #0A87FA 100%);
          font-family: 'Manrope', sans-serif !important;
          font-weight: 500;
          font-size: $h7FS;
          line-height: 18/14*1;
          padding: 10/1920*100vw 12/1920*100vw;
          max-width: 180/1920*100vw;
          // white-space:pre-wrap;
          color: $textColor1;
          cursor: pointer;
          }
          >div{
            @include makeitflex(column, center);
            background-color: $textColor1;
            height: 100%;
            >svg{
              width: 20/1920*100vw;
              margin: 0 auto;
              margin: 14/1920*100vw;
            }
          }
        }

      }
    }
    .info_inner{
      @include makeitflex(row, space-between);
      .col{
        .category{
          width: 600/1920*100vw;
          .category_title{
            cursor: pointer;
            @include makeitflex(row,center);
            align-items: center;
            background: linear-gradient(91.5deg, #00EBA4 0.15%, #5EB2FF 100%);
            border-radius: 20px;
            padding: 40/1920*100vw 220/1920*100vw 30/1920*100vw;
              font-family: 'Manrope', sans-serif !important;
              font-style: normal;
              font-weight: bold;
              font-size: $h5FS;
              line-height: 28/24*1;
              /* identical to box height */
              text-transform: uppercase;
            >svg{
              width: 10/1920*100vw;
              margin-left: 15/1920*100vw;
            }
          }
          .categoty_block{
            cursor: pointer;
            @include makeitflex(row, flex-start);
                align-items: center;
            padding: 25/1920*100vw 50/1920*100vw;
            font-family: 'Manrope', sans-serif !important;
            font-style: normal;
            font-weight: 500;
            font-size: $h5FS;
            line-height: 28/24*1;
            transition: border $transition_time $transition_anim_type;
            /* identical to box height */

            border-radius: 20px;
            margin-top: 5/1920*100vw;
            text-transform: capitalize;
              border: solid 2px transparent;
            &:hover{
              border: solid 2px $btncolor1;
            }
            >svg{
              width: 50/1920*100vw;
              margin-right: 30/1920*100vw;
            }
          }
        }
      }
    }
  }
  & iframe{
    width: 100%;
    min-height: 550/1920*100vw;
  }
}
</style>
